# 这个问题和“最多能完成排序的块”相似，但给定数组中的元素可以重复，输入数组最大长度为2000，其中的元素最大为10**8。 
# 
#  arr是一个可能包含重复元素的整数数组，我们将这个数组分割成几个“块”，并将这些块分别进行排序。之后再连接起来，使得连接的结果和按升序排序后的原数组相同。
#  
# 
#  我们最多能将数组分成多少块？ 
# 
#  示例 1: 
# 
#  
# 输入: arr = [5,4,3,2,1]
# 输出: 1
# 解释:
# 将数组分成2块或者更多块，都无法得到所需的结果。
# 例如，分成 [5, 4], [3, 2, 1] 的结果是 [4, 5, 1, 2, 3]，这不是有序的数组。 
#  
# 
#  示例 2: 
# 
#  
# 输入: arr = [2,1,3,4,4]
# 输出: 4
# 解释:
# 我们可以把它分成两块，例如 [2, 1], [3, 4, 4]。
# 然而，分成 [2, 1], [3], [4], [4] 可以得到最多的块数。 
#  
# 
#  注意: 
# 
#  
#  arr的长度在[1, 2000]之间。 
#  arr[i]的大小在[0, 10**8]之间。 
#  
# [2,1,3,4,4,4,4]
# [10,2,9,7,6]
# [10,2,9,7,6,8]
# [10,2,9,7,6,8,12]
# [10,2,9,7,6,8,12,9]
# [0,0,1,1,1]
# [1,0,1,3,2]

#  Related Topics 栈 贪心 数组 排序 单调栈 👍 161 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def maxChunksToSorted(self, arr: [int]) -> int:
        stack = []
        # 单调递增栈
        for num in arr:
            # 如果num比单调递增栈栈顶还小，则寻找栈内第一个比num小的元素，其余比num大的栈内元素都被归为一“块”
            if stack and num < stack[-1]:
                # 为维护单调栈的单调性，需要保存其栈顶元素(当前最大值)
                head = stack.pop()
                while stack and num < stack[-1]:
                    stack.pop()
                # 当stack中所有比num小的元素被清空，将栈顶元素重新接回去
                # 由于栈顶元素大于num，为维护单调栈，则num不再加入单调栈中
                stack.append(head)
            else:
                # 若num>=stack[-1]或stack为空，则加入此时num大于栈中出现过的所有元素，可以成为一”块“
                stack.append(num)
        # 栈的长度即为最大块数
        return len(stack)

# leetcode submit region end(Prohibit modification and deletion)
